<html>
<head>
<title>TerraView</title>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
</head>

<body bgcolor="#FFFFFF" text="#000000">
<font face="Arial, Helvetica, sans-serif" size="4">
<table width="100%">
  <tr>
 
  </tr>
  <tr> 
    <td><b><font size="4" face="Arial, Helvetica, sans-serif">Gera&ccedil;&atilde;o 
      de Pontos Amostrais</font></b><br>
      <hr>
      <p>O TerraView permite criar pontos amostrais de um plano ou tema de duas 
        formas: aleat&oacute;ria e estratificada. Na forma aleat&oacute;ria, s&atilde;o 
        gerados pontos aleatoriamente dentro do ret&acirc;ngulo envolvente do 
        plano ou tema de acordo com o n&uacute;mero de pontos especificado pelo 
        usu&aacute;rio. J&aacute; na forma estratificada, s&atilde;o gerados pontos 
        de acordo com um atributo ou legenda de um tema selecionado, com o n&uacute;mero 
        de pontos especificado ou ainda proporcionalmente de acordo com a &aacute;rea 
        da classe (atributo ou legenda selecionados). No final do processo &eacute; 
        gerado um Plano de Informa&ccedil;&atilde;o contendo os pontos amostrais 
        gerados. Essa ferramenta pode ter v&aacute;rias aplica&ccedil;&otilde;es, 
        um exemplo real &eacute; gerar pontos amostrais de casos de dengue de 
        uma cidade.</p>
      <p> Ao clicar no menu <b>An&aacute;lise</b> - <b>Gera&ccedil;&atilde;o de 
        Pontos Amostrais</b>, ser&aacute; exibida uma nova janela conforme mostra 
        a figura abaixo.</p>
      <p align="center"><img src="terraViewBase_arquivos/geracao_pontos_amostrais.png"></p>
      <p>1. Selecione o Tipo de gera&ccedil;&atilde;o de pontos: <b>Aleat&oacute;rio</b> 
        ou <b>Estratificado</b>.</p>
      <p>2. No tipo Aleat&oacute;rio, informe o <b>n&uacute;mero de pontos</b> 
        a serem gerados e o <b>Plano</b> ou <b>Tema</b> a ser utilizado, na &aacute;rea 
        Gera&ccedil;&atilde;o Aleat&oacute;ria Simples.</p>
      <p>3. No tipo Estratificado, informe o <b>n&uacute;mero total de pontos 
        por classe</b> ou selecione a op&ccedil;&atilde;o <b>Estratificada proporcionalmente 
        a &aacute;rea da classe</b> e informe o <b>n&uacute;mero m&iacute;nimo 
        de pontos por classe</b>, na &aacute;rea Gera&ccedil;&atilde;o Estratificada. 
        Selecione o <b>Tema</b> e o <b>atributo</b> a serem utilizados como refer&ecirc;ncia 
        na gera&ccedil;&atilde;o dos pontos amostrais ou ent&atilde;o selecione 
        a op&ccedil;&atilde;o <b>Usar a legenda corrente</b>.</p>
      <p>4. Preencha o campo <b>Plano de sa&iacute;da</b> com o nome desejado 
        para o plano de amostras a ser criado.</p>
      <p>5. Clique em <b>Executar</b>. Essa opera&ccedil;&atilde;o poder&aacute; 
        ser demorada dependendo do n&uacute;mero de pontos a serem gerados. Ser&aacute; 
        exibida uma mensagem informando que o plano de pontos foi criado e se 
        o usu&aacute;rio deseja visualiz&aacute;-lo. Clique em Sim para confirmar.</p>
      <p>Ao final da opera&ccedil;&atilde;o ser&aacute; criado um plano contendo 
        os pontos amostrais gerados, como mostra a figura abaixo. Os pol&iacute;gonos 
        em vermelho s&atilde;o do Tema utilizado como refer&ecirc;ncia e os pontos 
        em verde s&atilde;o os pontos amostrais gerados.</p>
      <p align="center"><img src="terraViewBase_arquivos/geracao_pontos_amostrais1.png" width="550" height="338" border="1"></p>
	  <p>&nbsp;</p>
    </td>
  </tr>
  <tr>
  </tr>
</table>
</font> 
</body>
</html>
