<html>
<head>
<title>TerraView</title>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
</head>

<body bgcolor="#FFFFFF" text="#000000">
<font face="Arial, Helvetica, sans-serif" size="4">
<table width="100%">
  <tr>
 
  </tr>
  <tr> 
    <td><b><font size="4" face="Arial, Helvetica, sans-serif">Atributos de M&iacute;dia</font></b><br>
      <hr>
      <p>O TerraView permite a inclus&atilde;o de atributos de objetos que s&atilde;o 
        estruturas complexas como imagem, arquivo de &aacute;udio, URL's ou algum 
        outro tipo de documentos. Esses atributos s&atilde;o chamados de atributos 
        de m&iacute;dia. Atributos de m&iacute;dia derivam de arquivos de dados 
        isolados cujo conte&uacute;do &eacute; copiado dentro do banco de dados. 
        Para facilitar a identifica&ccedil;&atilde;o da m&iacute;dia &eacute; 
        tamb&eacute;m mantida no banco de dados a localiza&ccedil;&atilde;o do 
        arquivo original usado na inser&ccedil;&atilde;o da m&iacute;dia. Como 
        exemplo, suponha que voc&ecirc; precisa associar a uma esta&ccedil;&atilde;o 
        de metr&ocirc; uma figura de um mapa ao redor de sua localiza&ccedil;&atilde;o. 
        Veja a figura abaixo.</p>
      <p align="center"><img src="terraViewBase_arquivos/midia.png" border="1"></p>
      <p>Para inserir um atributo de m&iacute;dia em um objeto:</p>
      <p>1. Selecione o objeto na &Aacute;rea de Grade ou na &Aacute;rea de Desenho. 
        Neste caso escolha a esta&ccedil;&atilde;o &quot;PARAISO&quot;.</p>
      <p>2. Clique com o bot&atilde;o direito do mouse em cima do objeto e escolha 
        a op&ccedil;&atilde;o <b>Inserir M&iacute;dia</b>. Selecione o arquivo 
        m&iacute;dia de dados. Neste caso o arquivo ftparaiso_map.jpg.</p>
      <p>3. Agora, d&ecirc; um duplo clique no objeto na &Aacute;rea de Desenho 
        e o TerraView abrir&aacute; a m&iacute;dia usando o programa apropriado.</p>
      <p>O procedimento de inser&ccedil;&atilde;o de URL &eacute; similar. Uma 
        outra op&ccedil;&atilde;o dispon&iacute;vel no menu &eacute; a entrada 
        de um texto de descri&ccedil;&atilde;o do atributo de m&iacute;dia ou 
        visualizar os atributos e m&iacute;dia.</p>
      <p align="center"><img src="terraViewBase_arquivos/midia1.png"></p>
	  <p> Outras observa&ccedil;&otilde;es sobre atributos de m&iacute;dia:</p>
      <p>- Podem ser inseridas mais de uma m&iacute;dia para o mesmo objeto;</p>
      <p>- A primeira m&iacute;dia inserida &eacute; considerada a m&iacute;dia 
        default;</p>
      <p>- Somente a m&iacute;dia default &eacute; aberta ao clicar sobre o objeto;</p>
      <p>- Para alterar a m&iacute;dia default, clique com o bot&atilde;o direito 
        do mouse sobre o nome da m&iacute;dia na janela de Atributos e M&iacute;dia 
        e clique na op&ccedil;&atilde;o para selecion&aacute;-la como m&iacute;dia 
        default;</p>
      <p>- Para abrir uma m&iacute;dia que n&atilde;o seja a m&iacute;dia default, 
        d&ecirc; um duplo clique sobre o nome da m&iacute;dia na janela de Atributos 
        e M&iacute;dia.<br>
      </p>
	   
      <p align="center"><img src="terraViewBase_arquivos/midia2.png"></p>
      <p>
      </p>
      <p>&nbsp;</p>
    </td>
  </tr>
  <tr>
  </tr>
</table>
</font> 
</body>
</html>
