<html>
<head>
<title>Barra de Cores</title>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
</head>

<body bgcolor="#FFFFFF">
<div align="justify">
  <H2 align="center"><font face="Arial, Helvetica, sans-serif"><u>Barra de Cores</u></font></H2>
<p><font face="Arial, Helvetica, sans-serif">A barra de cores &eacute; utilizada 
  para definir as cores de uma legenda ou de um fatiamento. </font></p>
<p><font face="Arial, Helvetica, sans-serif">A Figura 1 mostra a barra de cores 
  com gradua&ccedil;&otilde;es de vermelho. A gradua&ccedil;&atilde;o, mostrada 
  na barra, foi produzida a partir de duas cores prim&aacute;rias colocadas uma 
  em cada extremidade. No canto esquerdo foi colocado o vermelho e no outro lado 
  foi colocado o vermelho escuro. As cores produzidas na barra s&atilde;o resultantes 
  da mistura gradual para chegar do vermelho para o vermelho escuro.</font></p>
<p align="center"><font face="Arial, Helvetica, sans-serif"><img src="colorBar_arquivos/colorBar1.png" width="394" height="34"></font></p>
<p align="center"><font face="Arial, Helvetica, sans-serif">Fig. 1 - Barra de 
  cores.</font></p>
<p><font face="Arial, Helvetica, sans-serif">As cores utilizadas 
  em um fatiamento ou agrupamento s&atilde;o geradas a partir dessa barra. O crit&eacute;rio 
  &eacute; dividir a barra em n fatias ou n grupos para produzir as n cores necess&aacute;rias. 
  Por exemplo, para uma legenda com tr&ecirc;s grupos as cores produzidas, neste 
  caso, ser&atilde;o:</font></p>
<p><font face="Arial, Helvetica, sans-serif">- <img src="colorBar_arquivos/vermelho.png" width="20" height="15"> 
  vermelho (obitido da extremidade esquerda da barra),</font></p>
<p><font face="Arial, Helvetica, sans-serif">- <img src="colorBar_arquivos/vermelho2.png" width="21" height="16"> 
  vermelho m&eacute;dio (obtido da parte central da barra) e</font></p>
<p><font face="Arial, Helvetica, sans-serif">- <img src="colorBar_arquivos/vermelho3.png" width="21" height="16"> 
  vermelho escuro (obtido da extremidade direita da barra).</font></p>
<p><font face="Arial, Helvetica, sans-serif">A barra necessita ter 
  no m&iacute;nimo duas cores prim&aacute;rias, ou seja, &eacute; necess&aacute;rio 
  no m&iacute;nimo ter uma cor prim&aacute;ria em cada extremidade. As cores existentes 
  entre as cores prim&aacute;rias s&atilde;o resultantes da mistura entre elas. 
  Outras gradua&ccedil;&otilde;es com outras cores podem ser obtidas atrav&eacute;s 
  de opera&ccedil;&otilde;es que podem ser feitas na barra com o uso do mouse. 
  Essas opera&ccedil;&otilde;es s&atilde;o para:</font></p>
<p><font face="Arial, Helvetica, sans-serif">- inser&ccedil;&atilde;o 
  de cores, </font></p>
<p><font face="Arial, Helvetica, sans-serif">- remo&ccedil;&atilde;o 
  de cores,</font></p>
<p><font face="Arial, Helvetica, sans-serif">- substitui&ccedil;&atilde;o 
  de cores,</font></p>
<p><font face="Arial, Helvetica, sans-serif">- altera&ccedil;&atilde;o 
  de dist&acirc;ncia entre cores,</font></p>
<p><font face="Arial, Helvetica, sans-serif">- altera&ccedil;&atilde;o 
  de brilho de cada cor e</font></p>
<p><font face="Arial, Helvetica, sans-serif">- altera&ccedil;&atilde;o 
  simult&acirc;nea de brilho de todas as cores.</font></p>
<p><font face="Arial, Helvetica, sans-serif">Com essas opera&ccedil;&otilde;es 
  s&atilde;o poss&iacute;veis de se obter diferentes gradua&ccedil;&otilde;es 
  de cores.</font></p>
<p><font face="Arial, Helvetica, sans-serif">Todas as opera&ccedil;&otilde;es 
  s&atilde;o controladas pelo mouse. Movendo-se o mouse sobre a barra, o cursor 
  assume diversas formas ou tipos:</font></p>
<p align="center"><font face="Arial, Helvetica, sans-serif"><img src="colorBar_arquivos/cursorTypes.png" width="209" height="168"></font></p>
<p align="center"><font face="Arial, Helvetica, sans-serif">Fig 2 - Poss&iacute;veis 
  tipos de cursor tomados pelo mouse de acordo com a posi&ccedil;&atilde;o que 
  se encontra na barra de cores.</font></p>
<p><font face="Arial, Helvetica, sans-serif">Quando o mouse &eacute; 
  movido sobre a barra, o tipo de cursor varia de acordo com a localiza&ccedil;&atilde;o. 
  Os tipos de cursores s&atilde;o os seguintes:</font></p>
<p><font face="Arial, Helvetica, sans-serif">- <img src="colorBar_arquivos/arrow.png" width="21" height="23"> 
  &quot;arrow cursor&quot;, ocorre quando o mouse est&aacute; onde n&atilde;o 
  h&aacute; cor prim&aacute;ria.</font></p>
<p><font face="Arial, Helvetica, sans-serif">- <img src="colorBar_arquivos/splith.png" width="24" height="20"> 
  &quot;splitV cursor&quot; ocorre quando o mouse est&aacute; sobre uma cor prim&aacute;ria 
  (exceto nos cantos da barra).</font></p>
<p><font face="Arial, Helvetica, sans-serif">- <img src="colorBar_arquivos/splitv.png" width="22" height="24"> 
  &quot;splitH cursor&quot; ocorre quando o mouse est&aacute; sobre um dos tri&acirc;ngulos 
  da barra de cores.</font></p>
<p><font face="Arial, Helvetica, sans-serif">Todas as opera&ccedil;&otilde;es 
  s&atilde;o ativadas pelo mouse e o tipo de cursor &eacute; relacionado &agrave; 
  opera&ccedil;&atilde;o que se segue (ver <a href="#sumario">sum&aacute;rio das 
  opera&ccedil;&otilde;es</a>). Com o duplo click ativa-se a opera&ccedil;&atilde;o 
  para inserir ou remover uma cor. Ao arrastar o mouse sobre a barra ativa-se 
  opera&ccedil;&atilde;o de mudar a dist&acirc;ncia ou o brilho de uma cor. Vale 
  lembrar que, embora de forma menos eficiente, algumas opera&ccedil;&otilde;es 
  podem tamb&eacute;m ser efetuadas com o menu de contexto.</font></p>
<p><font face="Arial, Helvetica, sans-serif">A seguir &eacute; descrito 
  detalhadamente o uso do mouse para executar as opera&ccedil;&otilde;es sobre 
  a barra de cores:</font></p>
<p><font face="Arial, Helvetica, sans-serif">A inser&ccedil;&atilde;o 
  de uma nova cor &eacute; feita posicionando-se o cursor do mouse no local desejado 
  da barra (Figura 3). Os locais poss&iacute;veis para a inser&ccedil;&atilde;o 
  de cores, sobre a barra, s&atilde;o identificados pelo tipo do cursor do mouse. 
  Quando o cursor do mouse &eacute; do tipo &quot;ArrowCursor&quot; (o mesmo que 
  o default), indica que &eacute; poss&iacute;vel inserir uma nova cor sobre esse 
  local. Desta forma, aplicando-se um duplo click inicia-se a opera&ccedil;&atilde;o 
  de inser&ccedil;&atilde;o de cor. O primeiro passo dessa opera&ccedil;&atilde;o 
  &eacute; exibir a janela de sele&ccedil;&atilde;o de cor ilustrada na Figura 
  4.</font></p>
<p align="center"><font face="Arial, Helvetica, sans-serif"><img src="colorBar_arquivos/colorBar2.png" width="393" height="35"></font></p>
<p align="center"><font face="Arial, Helvetica, sans-serif">Fig. 3 - Barra de 
  cores com o mouse preparado para inserir uma nova cor.</font></p>
<p align="center"><font face="Arial, Helvetica, sans-serif"><img src="colorBar_arquivos/selectColor.png" width="488" height="403"></font></p>
<p align="center"><font face="Arial, Helvetica, sans-serif">Fig. 4 - Janela de 
  sele&ccedil;&atilde;o de cor.</font></p>
<p><font face="Arial, Helvetica, sans-serif">A janela de sele&ccedil;&atilde;o 
  de cor serve para escolher uma nova cor. A Figura 5 mostra a barra com a cor 
  verde inserida. Note que a inser&ccedil;&atilde;o da cor ocorre exatamente sobre 
  o local do duplo click do mouse sobre a barra. </font></p>
<p align="center"><font face="Arial, Helvetica, sans-serif"><img src="colorBar_arquivos/colorBar3.png" width="394" height="34"></font></p>
<p align="center"><font face="Arial, Helvetica, sans-serif">Fig. 5 - Barra de 
  cores com a cor verde inserida.</font></p>
  <p><font face="Arial, Helvetica, sans-serif">Essa mesma opera&ccedil;&atilde;o 
    pode ser feita utizando-se o bot&atilde;o direito do mouse sobre a barra de 
    cores e selecionando-se a op&ccedil;&atilde;o &quot;<strong>Adicionar Cor</strong>&quot; 
    do menu de contexto. A Figura 6 mostra o menu de contexto.</font></p>
<p align="center"><font face="Arial, Helvetica, sans-serif"><img src="colorBar_arquivos/addColor.png"></font></p>
<p align="center"><font face="Arial, Helvetica, sans-serif">Fig. 6 - Menu de contexto 
  da barra de cores.</font></p>
<p><font face="Arial, Helvetica, sans-serif">Outras cores podem ser 
  adicionadas repetindo-se a opera&ccedil;&atilde;o anterior. A Figura 7 mostra 
  a barra j&aacute; com a inser&ccedil;&atilde;o da cor amarela entre as cores 
  vermelha e a verde.</font></p>
<p align="center"><font face="Arial, Helvetica, sans-serif"><img src="colorBar_arquivos/colorBar7.png" width="394" height="34"></font></p>
<p align="center"><font face="Arial, Helvetica, sans-serif">Fig. 7 - Barra de 
  cores ap&oacute;s a inser&ccedil;&atilde;o da cor amarela entre as cores vermelha 
  e verde.</font></p>
<p><font face="Arial, Helvetica, sans-serif">A dist&acirc;ncia entre 
  cores &eacute; alterada mudando-se a posi&ccedil;&atilde;o da cor prim&aacute;ria 
  sobre a barra. Variando a dist&acirc;ncia altera-se o n&uacute;mero de cores 
  produzidas entre as cores prim&aacute;rias. A Figura 8 mostra a cor amarela 
  sendo arrastada (movimentada). Note que o mouse assume o cursor do tipo &quot;splitHCursor&quot; 
  quando &eacute; posicionado sobre uma regi&atilde;o onde se localiza uma cor 
  prim&aacute;ria. Note tambem que as cores prim&aacute;rias s&atilde;o destacadas 
  pelos tri&acirc;ngulos existentes logo acima da barra.</font></p>
<p align="center"><font face="Arial, Helvetica, sans-serif"><img src="colorBar_arquivos/colorBar8.png" width="393" height="33"></font></p>
<p align="center"><font face="Arial, Helvetica, sans-serif">Fig. 8 - Cor amarela 
  sendo movida para esquerda.</font></p>
<p><font face="Arial, Helvetica, sans-serif">OBS: As cores da extremidade 
  n&atilde;o podem ser movidas. Entretanto, elas podem ser trocadas de posi&ccedil;&atilde;o. 
  Por exemplo, se empurrar a cor amarela at&eacute; a extremidade esquerda, a 
  cor amarela ocupar&aacute; a posi&ccedil;&atilde;o da extremidade. A Figura 
  9 mostra a barra de cores onde a cor amarela foi deslocada para a extremidade 
  esquerda da barra, ou seja, a cor vermelha agora esta logo &agrave; direita 
  da cor amarela. Isto resulta em uma barra onde n&atilde;o &eacute; poss&iacute;vel 
  visualizar a cor amarela porque a dist&acirc;ncia da amarela para a vermelha 
  &eacute; muito pequena.</font></p>
<p align="center"><font face="Arial, Helvetica, sans-serif"><img src="colorBar_arquivos/colorBar9.png" width="395" height="34"></font></p>
<p align="center"><font face="Arial, Helvetica, sans-serif">Fig. 9 - Barra mostrando 
  a cor amarela deslocada totalmente para a esquerda.</font></p>
<p><font face="Arial, Helvetica, sans-serif">Com a cor amarela colocada 
  sobre a extemidade esquerda, agora, pode-se deslocar a cor vermelha. A Figura 
  10 mostra a cor vermelha sendo deslocada sobre a barra. Aumentando-se a dist&acirc;ncia 
  entre a cor amarela e a vermelha j&aacute; se torna poss&iacute;vel ver algumas 
  gradua&ccedil;&otilde;es entre elas.</font></p>
<p align="center"><font face="Arial, Helvetica, sans-serif"><img src="colorBar_arquivos/colorBar10.png" width="391" height="89"></font></p>
<p align="center"><font face="Arial, Helvetica, sans-serif">Fig. 10 - Barra de 
  cores com a cor vermelha sendo deslocada para a direita.</font></p>
<p><font face="Arial, Helvetica, sans-serif">Outra opera&ccedil;&atilde;o 
  permitida pela barra &eacute; a substitui&ccedil;&atilde;o de uma cor por outra. 
  Para isso o cursor do mouse assume o modo &quot;splitVCursor&quot;. Movendo-se 
  o mouse em torno de um dos tri&acirc;ngulos existentes logo acima da barra de 
  cores, o cursor assume o modo &quot;splitVCursor&quot;. Neste modo, tal qual 
  ilustrado na Figura 11, um duplo click ativa a interface de sele&ccedil;&atilde;o 
  de cor (Figura 12) para que a nova cor substitua a antiga. A Figura 13 mostra 
  a barra de cores ap&oacute;s a substitui&ccedil;&atilde;o da cor vermelho escura 
  pela cor azul clara.</font></p>
<p align="center"><font face="Arial, Helvetica, sans-serif"><img src="colorBar_arquivos/colorBar12.png" width="396" height="35"></font></p>
<p align="center"><font face="Arial, Helvetica, sans-serif">Fig. 11 - Duplo click 
  para substitui&ccedil;&atilde;o da cor vermelho escura.</font></p>
<p align="center"><font face="Arial, Helvetica, sans-serif"><img src="colorBar_arquivos/selectColor2.png" width="488" height="403"></font></p>
<p align="center"><font face="Arial, Helvetica, sans-serif">Fig. 12 - Interface 
  de sele&ccedil;&atilde;o de cor.</font></p>
<p align="center"><font face="Arial, Helvetica, sans-serif"><img src="colorBar_arquivos/colorBar13.png" width="395" height="33"></font></p>
<p align="center"><font face="Arial, Helvetica, sans-serif">Fig. 13 - Barra de 
  cores ap&oacute;s a substitui&ccedil;&atilde;o da cor vermelho escura pela cor 
  azul clara.</font></p>
<p><font face="Arial, Helvetica, sans-serif">Outra opera&ccedil;&atilde;o 
  poss&iacute;vel &eacute; a remo&ccedil;&atilde;o de uma cor. Para isso aponta-se 
  o mouse para uma das cores prim&aacute;rias sobre a barra. O cursor do mouse 
  ser&aacute; do tipo &quot;splitHCursor&quot;, assim como mostrado na Figura 
  14. A aplica&ccedil;&atilde;o de um duplo click remove a cor selecionada. A 
  Figura 15 mostra a barra de cores ap&oacute;s a remo&ccedil;&atilde;o da cor 
  vermelha.</font></p>
<p align="center"><font face="Arial, Helvetica, sans-serif"><img src="colorBar_arquivos/colorBar14.png" width="393" height="35"></font></p>
<p align="center"><font face="Arial, Helvetica, sans-serif">Fig. 14 - Barra de 
  cores preparada para remo&ccedil;&atilde;o da cor vermelha.</font></p>
<p align="center"><font face="Arial, Helvetica, sans-serif"><img src="colorBar_arquivos/colorBar15.png" width="396" height="34"></font></p>
<p align="center"><font face="Arial, Helvetica, sans-serif">Fig. 15 - Barra de 
  cores ap&oacute;s a remo&ccedil;&atilde;o da cor vermelha.</font></p>
<p><font face="Arial, Helvetica, sans-serif">A barra tambem permite 
  ajustar o brilho da cor. Para esta opera&ccedil;&atilde;o o mouse assume o modo 
  &quot;splitVCursor&quot;. Isso acontece quando move-se o mouse em torno de um 
  dos tri&acirc;ngulos existentes logo acima da barra de cores. A Figura 16 mostra 
  o mouse na posi&ccedil;&atilde;o de alterar o brilho da cor verde. A opera&ccedil;&atilde;o 
  &eacute; iniciada com a movimenta&ccedil;&atilde;o do mouse para cima ou para 
  baixo. Para cima aumenta o brilho e para baixo diminui o brilho. A Figura 17 
  mostra a cor verde com o brilho reduzido.</font></p>
<p align="center"><font face="Arial, Helvetica, sans-serif"><img src="colorBar_arquivos/colorBar16.png" width="393" height="36"> 
  </font></p>
<p align="center"><font face="Arial, Helvetica, sans-serif">Fig. 16 - Barra de 
  cores preparada para alterar o brilho da cor verde.</font></p>
<p align="center"><font face="Arial, Helvetica, sans-serif"><img src="colorBar_arquivos/colorBar17.png" width="393" height="36"></font></p>
<p align="center"><font face="Arial, Helvetica, sans-serif">Fig. 17 - Barra de 
  cores ap&oacute;s diminiur o brilho da cor verde.</font></p>
<p><font face="Arial, Helvetica, sans-serif">Outra opera&ccedil;&atilde;o 
  poss&iacute;vel &eacute; alterar o brilho de todas as cores simultaneamente. 
  Nesta opera&ccedil;&atilde;o o cursor do mouse assume o modo &quot;ArrowCursor&quot;. 
  Este tipo de cursor &eacute; default e temos ele na maior parte da barra de 
  cores. A Figura 18 ilustra o mouse em uma poss&iacute;vel posi&ccedil;&atilde;o 
  de inicio de opera&ccedil;&atilde;o de altera&ccedil;&atilde;o simult&acirc;nea 
  de brilho. Nessa situa&ccedil;&atilde;o, arrastando-se o mouse para cima ou 
  para baixo inicia-se essa opera&ccedil;&atilde;o. T&atilde;o logo isso acontece, 
  o cursor do mouse assume o tipo &quot;sizeVerCursor&quot;. Isto indica que o 
  brilho de todas as cores da barra est&atilde;o se alterando conforme o movimento 
  do mouse. A Figura 19 mostra a barra durante a opera&ccedil;&atilde;o de diminui&ccedil;&atilde;o 
  de brilho de todas as cores.</font></p>
<p align="center"><font face="Arial, Helvetica, sans-serif"><img src="colorBar_arquivos/colorBar18.png" width="394" height="35"></font></p>
<p align="center"><font face="Arial, Helvetica, sans-serif">Fig. 18 - Barra de 
  cores preparada para alterar o brilho de todas as cores.</font></p>
<p align="center"><font face="Arial, Helvetica, sans-serif"><img src="colorBar_arquivos/colorBar19.png" width="394" height="34"></font></p>
<p align="center"><font face="Arial, Helvetica, sans-serif">Fig. 19 - Opera&ccedil;&atilde;o 
  de diminui&ccedil;&atilde;o de brilho de todas as cores da barra.</font></p>
<p><font face="Arial, Helvetica, sans-serif"><b><i><a name="sumario"></a>SUM&Aacute;RIO 
  das opera&ccedil;&otilde;es</i></b></font></p>
<p><font face="Arial, Helvetica, sans-serif"><b> Note que as opera&ccedil;&otilde;es 
  dependem do tipo de cursor e eles mudam de acordo com lugar que se encontram 
  na barra de cores.</b></font></p>
<p><font face="Arial, Helvetica, sans-serif"><b>De acordo com o tipo 
  de cursor ativa-se a seguinte opera&ccedil;&atilde;o ao dar duplo click:</b></font></p>
<p><font face="Arial, Helvetica, sans-serif"><img src="colorBar_arquivos/arrow.png" width="21" height="23"> 
  <i><b>Adiciona uma nova cor na barra.</b></i></font></p>
<p><font face="Arial, Helvetica, sans-serif"><img src="colorBar_arquivos/splith.png" width="24" height="20"> 
  <i><b>Remove uma cor da barra.</b></i></font></p>
<p><font face="Arial, Helvetica, sans-serif"><img src="colorBar_arquivos/splitv.png" width="22" height="24"> 
  <i><b>Altera uma cor da barra.</b></i></font></p>
<p><font face="Arial, Helvetica, sans-serif"><b>De acordo com o tipo de cursor 
  ativa-se a seguinte opera&ccedil;&atilde;o ao dragar o mouse:</b></font></p>
<p><font face="Arial, Helvetica, sans-serif"><img src="colorBar_arquivos/splith.png" width="24" height="20"> 
  <i><b>Move a cor para a direita ou para a esquerda.</b></i></font></p>
<p><font face="Arial, Helvetica, sans-serif"><img src="colorBar_arquivos/splitv.png" width="22" height="24"> 
  <i><b>Altera o brilho da cor selecionada. Para cima aumenta o brilho e para 
  baixo diminue o brilho.</b></i></font></p>
<p><font face="Arial, Helvetica, sans-serif"><img src="colorBar_arquivos/arrow.png" width="21" height="23"> 
  <i><b>Ao iniciar o drag o tipo de cursor muda para <img src="colorBar_arquivos/sizever.png" width="21" height="23">e 
  indica que o brilho de todas as cores est&atilde;o se modificando.</b><b></b></i></font><font face="Arial, Helvetica, sans-serif"><i><b></b></i></font></p>
<p>&nbsp;</p>
<p><font face="Arial, Helvetica, sans-serif">NOTA: as opera&ccedil;&otilde;es 
  descritas acima podem ser feitas com o menu de contexto.</font></p>
<p>&nbsp;</p>
<p>&nbsp; </p>
<p>&nbsp; </p>
</div>
</body>
</html>
