<HTML> <HEAD> <TITLE> TerraView - Perguntas mais frequentes  </TITLE> </HEAD>

<BODY>
	
<p align="center"> <big><b><font size="4" face="Arial, Helvetica, sans-serif">TerraView 
  -  </font></b></big><font size="4" face="Arial, Helvetica, sans-serif"> 
   <b>Perguntas mais frequentes</b> </font> </p>

	
<hr>
<font  size="3" face="Arial, Helvetica, sans-serif">
<p align="justify"><strong>Como fazer Geocodifica&ccedil;&atilde;o de endere&ccedil;os no TerraView?</strong></p>
<hr>
<p align="justify">Geocodificar endere&ccedil;os significa localizar espacialmente cada endere&ccedil;o 
  em um ponto corretamente. </p>
<p align="justify">Para isso &eacute; necess&aacute;rio ter uma malha de ruas 
  detalhada, onde cada rua deve estar dividida em trechos e cada trecho deve 
  ter as informa&ccedil;&otilde;es sobre o n&uacute;mero inicial e final de cada 
  lado da rua. </p>
<p align="justify">A primeira etapa &eacute; ter esse plano de informa&ccedil;&atilde;o 
  e configur&aacute;-lo corretamente dizendo quais campos equivalem a quais 
  informa&ccedil;&otilde;es. Sem essa base de refer&ecirc;ncia de logradouros 
  n&atilde;o tem como geocodificar endere&ccedil;os.  </p>
<p align="justify">O segundo passo &eacute; ter uma tabela com os endere&ccedil;os 
  que se quer geocodificar, por exemplo os endere&ccedil;os com ocorr&ecirc;ncias 
  de dengue. Essa tabela deve ser importada informando que ela tem essa 
  finalidade, ou seja, é do tipo "dados de geocodifica&ccedil;&atilde;o". </p>
<p align="justify">Na sequ&ecirc;ncia do assistente de geocodifica&ccedil;&atilde;o 
  configura-se essa tabela especificando que campos dela correspondem a quais informa&ccedil;&otilde;es. 
</p>
<p align="justify">Finalmente o TerraView vai gerar um novo plano de informa&ccedil;&atilde;o 
  contendo para cada endere&ccedil;o um ponto com as coordenadas geograficas calculadas. Os atributos deste plano serão
  trazidos da tabela de geocodificação que foi importada. </p>
  
<p align="justify">  O assistente de geocodificação está dispon&iacute;vel atrav&eacute;s da op&ccedil;&atilde;o <strong><b>Arquivo &gt; Geocodifica&ccedil;&atilde;o de Endereços. </b></strong>
  </p>
</font>	
  <hr>
	
</BODY>
</HTML>
