<HTML> <HEAD> <TITLE> TerraView - Perguntas mais frequentes  </TITLE> </HEAD>

<BODY>
	
<p align="center"> <big><b><font size="4" face="Arial, Helvetica, sans-serif">TerraView 
  -  </font></b></big><font size="4" face="Arial, Helvetica, sans-serif"> 
   <b>Perguntas mais frequentes</b> </font> </p>

	
<hr>
<p align="justify"><strong>Como reposicionar, remover ou alterar o tamanho de um r&oacute;tulo de objeto?</strong></p>

<hr>
<div align="justify"> 
  <p>R&oacute;tulos de objetos s&atilde;o textos usados para identificaç&atilde;o 
    visual dos objetos. Eles podem ser gerados usando uma ferramenta disponível 
    no <em>TerraView</em>. Para isso, veja a pergunta <a href="FAQ_gerandoTexto.htm">Como 
    gerar texto associado a atributos de um plano de informaç&atilde;o?</a> <br>  	
	
  <p>Para <u>reposicionar</u> um r&oacute;tulo, selecione o &iacute;cone <b>E</b> 
    (Edi&ccedil;&atilde;o do Tema) na barra de ferramentas, e em seguida o cursor 
    de apontamento (seta). O pr&oacute;ximo passo &eacute; selecionar o r&oacute;tulo, 
    para isso posicione o cursor seta sobre ele, clique e mantenha pressionado 
    o bot&atilde;o esquerdo do mouse, ver&aacute; que o cursor muda de seta para uma 
    cruz; ainda com ele pressionado, arraste o mouse sobre o r&oacute;tulo, formando 
    um quadrado ou um ret&acirc;ngulo, e libere o bot&atilde;o. Ao ver que o r&oacute;tulo 
    ficou selecionado, coloque o cursor sobre o centro do mesmo at&eacute; aparecer 
    uma m&atilde;ozinha, e o arraste clicando no bot&atilde;o esquerdo do mouse 
    e movimentando para o local desejado, liberando o bot&atilde;o quando concluir.</p>
  <p>Para <u>remover</u>, selecione o r&oacute;tulo usando o procedimento anterior de sele&ccedil;&atilde;o, e aperte a tecla Delete 
    do seu teclado. </p>
  <p>Para <u>alterar o tamanho</u> do r&oacute;tulo, repita o procedimento anterior de sele&ccedil;&atilde;o
  	e coloque o cursor sobre a borda do rótulo, ver&aacute; o cursor mudar para uma seta. Clique no bot&atilde;o 
  	esquerdo do mouse e arraste lentamente, aumentando ou diminuindo o r&oacute;tulo, e libere o bot&atilde;o para concluir
  	a opera&ccedil;&atilde;o.
  </p>
        <u>Observa&ccedil;&atilde;o 1</u> : A opera&ccedil;&atilde;o de sele&ccedil;&atilde;o de r&oacute;tulo pode ser feita
        para selecionar diversos r&oacute;tulos ao mesmo tempo, definindo-se uma &aacute;rea que engloba
        todos os r&oacute;tulos desejados. Isso &eacute; feito clicando no botão esquerdo do mouse e arrastando o mouse enquanto
        o cursor se encontra no formato de cruz.
        Com isto, <u>&eacute; possível reposicionar, remover ou alterar o tamanho de v&aacute;rios r&oacute;tulos ao mesmo tempo</u>.
  </p>
<br>
  </p>
        <u>Observa&ccedil;&atilde;o 2</u> : A opera&ccedil;&atilde;o de altera&ccedil;&atilde;o de tamanho de um r&oacute;tulo de objeto
        n&atilde;o fica disponível para os rótulos gerados com a op&ccedil;&atilde;o de visual de texto "Tamanho Fixo" selecionada. Esta restri&ccedil;&atilde;o perdura
        mesmo que, ap&oacute;s a gera&ccedil;&atilde;o dos r&oacute;tulos, a citada op&ccedil;&atilde;o seja desselecionada.
      </p>
</div>
<p align="justify"></p>
<hr>
	
		
</BODY>
</HTML>
