<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<title>TerraView</title>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
</head>

<body>
<p><font size="3" face="Arial"><strong>TerraView  </strong> </font></p>
<p align="right"><font face="Arial"><a href="funcao.htm">&lt;&lt; Anterior</a>&nbsp;|&nbsp;<a href="terraViewBase.htm">In&iacute;cio</a> 
  | <a href="graficos_dispersao_3d.htm">Próximo &gt;&gt;</a><font face="Arial"> 
  </font> </font></p>
<hr>
<font face="Arial"> 
<p align="center"><font size="4" face="Arial"><strong><u><strong>Fazendo Gr&aacute;ficos 
  de Probabilidade Normal</strong></u></strong></font></p>
</font><p>&nbsp;</p>
      <p  ><font face="Arial">Outro tipo de gr&aacute;fico que o 
        TerraView oferece a voc&ecirc; &eacute; o gr&aacute;fico de probabilidade 
        normal. Esse gr&aacute;fico &eacute; &uacute;til para verificar a validade 
        da suposi&ccedil;&atilde;o de que uma amostra de interesse tenha sido 
        extra&iacute;da de uma distribui&ccedil;&atilde;o normal. Use o menu pop-up 
        do tema SetoresCensitarios e selecione Par&acirc;metros do gr&aacute;fico 
        para abrir a janela de elabora&ccedil;&atilde;o de gr&aacute;ficos. Escolha 
        o Tipo de Gr&aacute;fico como Probabilidade Normal, colocando no Atributo(X) 
        a quantidade de pessoas do sexo masculino entre zero e 5 anos de idade 
        completos (H_0_5). No campo Objetos, mantenha a op&ccedil;&atilde;o Todos, 
        para utilizar todos os dados no gr&aacute;fico.<br>
        </font></p>
      
<p align="center"><font face="Arial"><img src="terraViewBase_arquivos/parametro_probalid_normal.png" width="535" height="177"> 
  </font></p>
      <p  ><font face="Arial">O gr&aacute;fico de probabilidade 
        normal, onde uma das coordenadas (x) &eacute; apresentada com escala aritm&eacute;tica 
        e, a outra (y), em porcentagem acumulada, constitui uma forma de visualiza&ccedil;&atilde;o 
        da ader&ecirc;ncia dos valores &agrave; distribui&ccedil;&atilde;o normal; 
        o gr&aacute;fico apresentado em linha azul refere-se aos dados amostrais 
        e a linha vermelha refere-se &agrave; distribui&ccedil;&atilde;o normal; 
        assim, quanto mais pr&oacute;xima &agrave; linha azul estiver da reta 
        vermelha, mais v&aacute;lida &eacute; uma suposi&ccedil;&atilde;o de normalidade 
        para os seus dados amostrais:</font></p>
      <p></p>
      <p align="center"><font face="Arial"> <img src="terraViewBase_arquivos/parametro_probalid_normal1.png" border="1"></font></p>
      <p  ><font face="Arial">O gr&aacute;fico de probabilidade 
        normal, onde uma das coordenadas (x) &eacute; apresentada com escala aritm&eacute;tica 
        e, a outra (y), em porcentagem acumulada, constitui uma forma de visualiza&ccedil;&atilde;o 
        da ader&ecirc;ncia dos valores &agrave; distribui&ccedil;&atilde;o normal; 
        o gr&aacute;fico apresentado em linha azul refere-se aos dados amostrais 
        e a linha vermelha refere-se &agrave; distribui&ccedil;&atilde;o normal; 
        assim, quanto mais pr&oacute;xima &agrave; linha azul estiver da reta 
        vermelha, mais v&aacute;lida &eacute; uma suposi&ccedil;&atilde;o de normalidade 
        para os seus dados amostrais:</font></p>
      <p align="center"><font face="Arial"><img src="terraViewBase_arquivos/parametro_probalid_normal2.png" border="1"></font></p>
      <p  ><font face="Arial">Como voc&ecirc; pode observar, a linha 
        azul, representando os dados, est&aacute; muito mais pr&oacute;xima da 
        linha vermelha, representando a distribui&ccedil;&atilde;o normal, estando 
        as duas quase coincidentes. A suposi&ccedil;&atilde;o de normalidade para 
        a quantidade de indiv&iacute;duos do sexo masculino com idades de 45 anos 
        ou mais dentro dos setores censit&aacute;rios de BH &eacute;, portanto, 
        bastante significante.</font></p>
      <p  ><font face="Arial">Para prosseguir nos demais cap&iacute;tulos 
        e obter resultados id&ecirc;nticos, fa&ccedil;a as seguintes altera&ccedil;&otilde;es:</font></p>
        
        
<p  ><font face="Arial">1. No menu popup do tema SetoresCensitarios selecione 
  <strong>Visual &gt; Default</strong>..., escolha <em>Estilo como Transparente</em> 
  e pressione<em><strong> </strong>Executar;</em></font></p>
<p  ><font face="Arial"> 2. No menu popup do tema SetoresCensitarios selecione 
  <strong>Remover Cores &gt; Objetos Apontados</strong>; Mapas Tem&aacute;ticos</font></p>
       
      <p  ><font face="Arial">Os mapas tem&aacute;ticos s&atilde;o 
        utilizados para colorir os mapas segundo atributos de seu interesse, definindo 
        categorias para os objetos, segundo suas cores. Voc&ecirc; pode, por exemplo, 
        categorizar os homic&iacute;dios de acordo com o sexo ou idade da v&iacute;tima; 
        categorizar munic&iacute;pios segundo sua popula&ccedil;&atilde;o, o n&uacute;mero 
        de seq&uuml;estros ocorridos ou a taxa de seq&uuml;estros.</font></p>
      <p  ><font face="Arial">No TerraView, os elementos de desenho 
        associados a atributos dos objetos mostrados no mapa (cores diferenciadas, 
        gr&aacute;ficos de torta) s&atilde;o denominados de Legenda do Tema e 
        est&atilde;o representados na &Aacute;rvore de Vistas abaixo do tema correspondente.</font></p>
   &nbsp; 
  <hr>
<p align="right"><font face="Arial"><a href="funcao.htm">&lt;&lt; Anterior</a>&nbsp;|&nbsp;<a href="terraViewBase.htm">In&iacute;cio</a> 
  | <a href="graficos_dispersao_3d.htm">Próximo &gt;&gt;</a><font face="Arial"> 
  </font> </font></p>
<font face="Arial"><p  ><font face="Arial"> </font></p>
</font><font face="Arial"></font> 
</body>
</html>
