<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<title>TerraView</title>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
</head>

<body>
<p><font size="3" face="Arial"><strong>TerraView  </strong> </font></p>
<p align="right"><font face="Arial"><a href="usando_ferramenta_brush.htm">&lt;&lt; 
  Anterior</a>&nbsp;|&nbsp;<a href="terraViewBase.htm">In&iacute;cio</a> | <a href="funcao.htm">Próximo 
  &gt;&gt;</a><font face="Arial"> </font> </font></p>
<hr>
<font face="Arial"> 
<p align="center"><font size="4" face="Arial"><strong><u><strong>Fazendo Gr&aacute;ficos 
  de Dispers&atilde;o</strong></u></strong></font></p>
</font><p>&nbsp;</p>
      
<p align="justify"  ><font face="Arial">Outro tipo de gr&aacute;fico bastante 
  &uacute;til, a partir do qual voc&ecirc; pode analisar o comportamento de duas 
  vari&aacute;veis ao mesmo tempo, &eacute; o Gr&aacute;fico de Dispers&atilde;o. 
  Voc&ecirc; pode querer, por exemplo, analisar como est&aacute; a renda m&eacute;dia 
  mensal em rela&ccedil;&atilde;o ao tamanho da popula&ccedil;&atilde;o analfabeta 
  nos setores censit&aacute;rios de Belo Horizonte, para verificar se existe algum 
  que apresenta um comportamento diferente. Reative a visualiza&ccedil;&atilde;o 
  da &Aacute;rvore de Vistas e torne o tema SetoresCensitarios ativo em seu TerraView. 
  Use o menu pop-up, selecione <strong>Par&acirc;metros do Gr&aacute;fico</strong> 
  para abrir a janela de elabora&ccedil;&atilde;o de gr&aacute;ficos. Escolha 
  o Tipo de <em>Gr&aacute;fico como Dispers&atilde;o</em>, colocando no Atributo(X) 
  os dados de renda m&eacute;dia dos setores (REN_MED) e no Atributo(Y) a porcentagem 
  de analfabetos do setor (P_ANALF): <br>
  </font></p>
      
<p align="center"><font face="Arial"><img src="terraViewBase_arquivos/parametro_grafico.png" width="476" height="157"> 
  </font></p>
      
<p align="justify"  ><font face="Arial">O gr&aacute;fico gerado ter&aacute; no 
  eixo X a renda m&eacute;dia mensal e no eixo Y a porcentagem de analfabetos. 
  Cada ponto do gr&aacute;fico representa um setor censit&aacute;rio: sua renda 
  m&eacute;dia &eacute; o valor no eixo X e taxa de analfabetismo &eacute; o valor 
  no eixo Y. Voc&ecirc; pode verificar que os setores censit&aacute;rios de BH 
  seguem um forte comportamento de proporcionalidade inversa entre a sua renda 
  m&eacute;dia mensal e a taxa de analfabetismo: quanto maior a renda mensal de 
  um setor, menor &eacute; a sua popula&ccedil;&atilde;o analfabeta. Voc&ecirc; 
  pode verificar que os pontos formam uma curva que se aproxima de ambos os eixos:</font></p>
      <p align="center"><font face="Arial"><img src="terraViewBase_arquivos/grafico_dispersao.png" border="1"></font></p>
      
<p align="justify"  ><font face="Arial">Os setores com maiores taxas de analfabetismo 
  n&atilde;o possuem renda mensal, enquanto existem setores com renda m&eacute;dia 
  mensal superior a R$ 10.000,00. Para verificar no mapa a localiza&ccedil;&atilde;o 
  dessas &aacute;reas com alta taxa de analfabetismo, podemos utilizar a ferramenta 
  brush. Torne a Tela de Visualiza&ccedil;&atilde;o ativa. Agora, selecione o 
  Cursor de Gr&aacute;fico e na Tela de Visualiza&ccedil;&atilde;o de Gr&aacute;fico 
  altere o seu tamanho (utilizando Alt e Crtl, como para sele&ccedil;&atilde;o 
  de objetos em mapas) a fim de selecionar os cinco pontos de maior porcentagem 
  de analfabetos; o mapa n&atilde;o aparentar&aacute; modifica&ccedil;&otilde;es, 
  pois os setores censit&aacute;rios selecionados s&atilde;o min&uacute;sculos. 
  Utilize ent&atilde;o o campo de fator de redu&ccedil;&atilde;o &agrave; extrema 
  direita no alto da tela e selecione 25000. Um dos setores aparecer&aacute; selecionado 
  em verde; se desejar procurar os demais, voc&ecirc; poder&aacute; utilizar o 
  Cursor de V&ocirc;o e ir arrastando o mapa.</font></p>
      <p align="center"><font face="Arial"><img src="terraViewBase_arquivos/grafico_dispersao_brushing.png" border="1"></font></p>
      
<p align="justify"  ><font face="Arial">Os setores, al&eacute;m de min&uacute;sculos, 
  n&atilde;o s&atilde;o pr&oacute;ximos, o que indica que a alta taxa de analfabetismo 
  n&atilde;o parece ser devido &agrave; sua rela&ccedil;&atilde;o espacial. Os 
  gr&aacute;ficos de dispers&atilde;o podem ser utilizados e se mostram bastante 
  eficazes para analisar vari&aacute;veis que evoluem no tempo como, por exemplo, 
  o n&uacute;mero de homic&iacute;dios por ano ao longo dos anos. Podemos definir 
  regi&otilde;es onde esse n&uacute;mero cresceu e diminui fora do padr&atilde;o 
  esperado.</font></p>
<hr>
<p align="right"><font face="Arial"><a href="usando_ferramenta_brush.htm">&lt;&lt; 
  Anterior</a>&nbsp;|&nbsp;<a href="terraViewBase.htm">In&iacute;cio</a> | <a href="funcao.htm">Próximo 
  &gt;&gt;</a><font face="Arial"> </font></font></p>
<font face="Arial"><p  ><font face="Arial"> </font></p>
</font><font face="Arial"></font> 
</body>
</html>
