<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<title>TerraView</title>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
</head>

<body>
<p><font size="3" face="Arial"><strong>TerraView  </strong> </font></p>
<p align="right"><font face="Arial"><font face="Arial"><font face="Arial"><font face="Arial"><a href="importando_tabelas_atributos.htm">&lt;&lt; 
  Anterior</a>&nbsp;|&nbsp;<a href="terraViewBase.htm">In&iacute;cio</a> | <a href="exportacao_dados.htm">Próximo 
  &gt;&gt;</a></font> </font></font></font></p>
<hr>
<font face="Arial"> 
<p align="center"><font size="4"><strong><u><font face="Arial"><strong>Importando 
  Tabelas Externas</strong></font></u></strong></font></p>
<p  >&nbsp;</p>
</font>
<div> 
  <p  ><font face="Arial">Se voc&ecirc; quiser importar dados externos 
    cuja coluna de liga&ccedil;&atilde;o n&atilde;o &eacute; a mesma da identifica&ccedil;&atilde;o 
    dos objetos geogr&aacute;ficos (Chave Prim&aacute;ria), voc&ecirc; n&atilde;o 
    poder&aacute; associ&aacute;-la a nenhuma camada. A tabela ser&aacute; importada 
    como uma Tabela Externa e, posteriormente, voc&ecirc; poder&aacute; associ&aacute;-la 
    a um tema. O procedimento de importa&ccedil;&atilde;o &eacute; o mesmo que 
    o anterior, com a diferen&ccedil;a que se escolhe o tipo de liga&ccedil;&atilde;o 
    como Externa. A tabela &eacute; importada, mas n&atilde;o est&aacute; associada 
    a nenhuma camada ou tema. Importe a tabela txdesemprego. Agora vamos lig&aacute;-la 
    ao tema UP.</font></p>
  <p  ><font face="Arial">Para que voc&ecirc; ligue esta tabela externa ao seu 
    tema, voc&ecirc; dever&aacute; ativar o menu popup do mesmo e escolher a op&ccedil;&atilde;o 
    <strong>Conectar Tabela Externa</strong>.</font></p>
  <p align="left"><font face="Arial"> A janela Liga&ccedil;&atilde;o de Tabela 
    Externa ir&aacute; aparecer. Nela voc&ecirc; poder&aacute; visualizar os dados 
    de todas as tabelas de atributo do sistema. </font></p>
  <p align="center"><font face="Arial"><img src="terraViewBase_arquivos/ligacao_tab_ext.png" width="378" height="315"></font></p>
    
    <div  > 
      <p><font face="Arial">1. Escolha a tabela que deseja ligar ao seu tema (txdesemprego) 
        .</font></p>
      <p  ><font face="Arial">2. Escolha a coluna de liga&ccedil;&atilde;o 
        (object_id_), clicando sobre ela. Uma coluna de liga&ccedil;&atilde;o 
        &eacute; aquela que permite identificar o objeto descrito na tabela externa 
        (cada linha) com o objeto geogr&aacute;fico existente na camada. Ela deve 
        conter identificadores &uacute;nicos de objeto. </font></p>
      <p  ><font face="Arial"> 3. Mantendo o mouse pressionado sobre 
        a coluna de liga&ccedil;&atilde;o, arraste-a at&eacute; a coluna da janela 
        de Grade com a informa&ccedil;&atilde;o correspondente. O cursor conter&aacute; 
        o s&iacute;mbolo de proibido at&eacute; que voc&ecirc; esteja sobre o 
        nome de uma coluna na janela de grade, quando mudar&aacute; para o formato 
        de uma m&atilde;o. Arraste o mouse at&eacute; o r&oacute;tulo da coluna 
        COD_UP da grade e solte o mouse para realizar a liga&ccedil;&atilde;o. 
        </font></p>
      <p  ><font face="Arial">4. Observe que as novas informa&ccedil;&otilde;es 
        sobre taxa de desemprego est&atilde;o agora dispon&iacute;veis na tabela 
        de atributos associada ao tema UP. </font></p>
    </div>
   
  <p  ><font face="Arial">A diferen&ccedil;a entre os tipos de importa&ccedil;&atilde;o 
    de dados tabulares &eacute; que, caso voc&ecirc; conecte a tabela a uma camada, 
    ela sempre estar&aacute; dispon&iacute;vel para sele&ccedil;&atilde;o na cria&ccedil;&atilde;o 
    do tema. Caso contr&aacute;rio, voc&ecirc; ter&aacute; que acrescentar a tabela 
    ao tema depois de sua cria&ccedil;&atilde;o.</font></p>
</div>
<hr>
<p align="right"><font face="Arial"><font face="Arial"><font face="Arial"><font face="Arial"><a href="importando_tabelas_atributos.htm">&lt;&lt; 
  Anterior</a>&nbsp;|&nbsp;<a href="terraViewBase.htm">In&iacute;cio</a> | <a href="exportacao_dados.htm">Próximo 
  &gt;&gt;</a></font> </font></font> </font></p>
<font face="Arial"><p  ><font face="Arial"> </font></p>
</font><font face="Arial"></font> 
</body>
</html>
