<html>
<head>
<title>Visual</title>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
</head>

<body bgcolor="#FFFFFF" text="#000000">
<font face="Arial, Helvetica, sans-serif" size="4">
<table width="100%">
  <tr>
    <td>&nbsp;</td>
  </tr>
  <tr> 
    <td><b>Mais Informa&ccedil;&otilde;es sobre o Visual</b><br>
      <hr>
      <p>Ao criar um tema, o mapa &eacute; desenhado com o visual padr&atilde;o 
        que poder&aacute; ser alterado a qualquer momento, no TerraView o visual 
        padr&atilde;o pode ser alterado conforme a conveni&ecirc;ncia do usu&aacute;rio. 
        O TerraView permite mudar o visual padr&atilde;o de pol&iacute;gonos (ou 
        c&eacute;lulas), linhas, pontos e texto. <br>
        O visual padr&atilde;o cont&eacute;m as caracter&iacute;sticas visuais 
        de um mapa quando n&atilde;o se faz nenhum tipo de an&aacute;lise, ou 
        seja, &eacute; um mapa onde todos os pol&iacute;gonos, linhas, pontos 
        e textos s&atilde;o desenhados com os respectivos visuais de suas representa&ccedil;&otilde;es. 
        O mais simples tipo de realce de objetos &eacute; atribuir a ele um visual 
        pr&oacute;prio. <br>
        No TerraView os visuais pr&oacute;prios podem ser definidos sobre as representa&ccedil;&otilde;es 
        que usam o visual padr&atilde;o. Isto significa que o visual pr&oacute;prio 
        tem prioridade sobre o visual padr&atilde;o. Ent&atilde;o, o objeto que 
        possui visual pr&oacute;prio n&atilde;o ser&aacute; desenhado com o visual 
        padr&atilde;o e sim com o visual pr&oacute;prio. Retirando-se o visual 
        pr&oacute;prio, sua representa&ccedil;&atilde;o volta a ser desenhada 
        com o visual padr&atilde;o. Isto &eacute; interessante para o usu&aacute;rio 
        marcar os objetos que possuem alguma caracter&iacute;stica importante.<br>
        O pr&oacute;ximo visual de maior prioridade no TerraView &eacute; o visual 
        de agrupamento. Este visual se sobrep&otilde;e ao visual pr&oacute;prio 
        e ao visual padr&atilde;o. No TerraView, toda vez que se executa um agrupamento, 
        perdem-se os visuais pr&oacute;prios momentaneamente. Os visuais pr&oacute;prios 
        s&oacute; existem quando n&atilde;o se tem agrupamento (legenda). Quando 
        os objetos s&atilde;o desagrupados, as suas representa&ccedil;&otilde;es 
        voltam a ser desenhadas com o visual padr&atilde;o e/ou com o visual pr&oacute;prio. 
        <br>
        O visual de consulta &eacute; utilizado para real&ccedil;ar os objetos 
        que s&atilde;o selecionados pelo m&oacute;dulo de consulta. O visual de 
        consulta apenas altera a cor dos objetos selecionados. Os objetos s&atilde;o 
        desenhados mantendo-se o mesmo estilo, tamanho e tipo das representa&ccedil;&otilde;es. 
        Logo, se o objeto selecionado &eacute; representado pelo visual padr&atilde;o 
        por um pol&iacute;gono hachurado, este pol&iacute;gono ser&aacute; redesenhado 
        utilizando-se a mesma hachura, por&eacute;m, com a cor definida pelo visual 
        de consulta. Se o objeto estiver sendo representado por um visual de agrupamento, 
        este ser&aacute; redesenhado com o mesmo estilo, medida e tipo definido 
        pelo visual de agrupamento, por&eacute;m, a cor &eacute; mudada para a 
        cor do visual de consulta. A id&eacute;ia &eacute; o usu&aacute;rio ver 
        quais s&atilde;o os objetos que satisfazem &agrave;quela condi&ccedil;&atilde;o, 
        n&atilde;o importando se o objeto estava ou n&atilde;o agrupado. <br>
        O realce acontece tamb&eacute;m sobre as linhas da tabela para que o usu&aacute;rio 
        possa ver os atributos dos objetos selecionados pela consulta. <br>
        Retirando-se a consulta o mapa volta a ser desenhado com os visuais que 
        ele possu&iacute;a antes da execu&ccedil;&atilde;o da consulta. Isto &eacute;, 
        o TerraView recupera o mapa como estava antes da consulta. A tabela tamb&eacute;m 
        volta a ser desenhada como estava antes da consulta. <br>
        O visual de apontamento apenas muda a cor do objeto apontado e mant&eacute;m 
        suas caracter&iacute;sticas anteriores. Neste caso, n&atilde;o importa 
        se o objeto apontado era desenhado com o visual padr&atilde;o, pr&oacute;prio, 
        agrupamento ou de consulta. A id&eacute;ia &eacute; permitir ao usu&aacute;rio 
        ver o objeto apontado. <br>
        O apontamento pode ser feito da tabela para o mapa ou do mapa para a tabela. 
        No primeiro caso, se apontado para as caracter&iacute;sticas sobre a tabela, 
        o usu&aacute;rio poder&aacute; descobrir no mapa, onde o objeto se localiza 
        e descobrir qual a sua forma, sua vizinhan&ccedil;a, etc. No segundo caso, 
        se apontado para uma representa&ccedil;&atilde;o sobre o mapa, o usu&aacute;rio 
        poder&aacute; descobrir, sobre a tabela, quais s&atilde;o as suas caracter&iacute;sticas. 
        <br>
        Por &uacute;ltimo, o TerraView define um visual que permite diferenciar 
        onde ocorrem as interse&ccedil;&otilde;es de apontamento e de consulta 
        ao mesmo tempo. Isto &eacute;, quais s&atilde;o os objetos que est&atilde;o 
        ao mesmo tempo sendo selecionados por uma consulta e sendo apontados simultaneamente. 
        <br>
        Todo o objeto, independente da consulta realizada, ter&aacute; sua respectiva 
        linha na grade de pesquisa (tabela) marcada, com a mesma cor que a representa&ccedil;&atilde;o 
        por pol&iacute;gono, linha, ponto estiver sendo usada na Tela de Visualiza&ccedil;&atilde;o.</p>
      </td>
  </tr>
  <tr>
  </tr>
</table>
</font> 
</body>
</html>
