<html>
<head>
<title>TerraView</title>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
</head>

<body bgcolor="#FFFFFF" text="#000000">
<font face="Arial, Helvetica, sans-serif" size="4">
<table width="100%">
  <tr>
    <td>&nbsp;</td>
  </tr>
 
    <td><b>Metadados de M&uacute;ltiplos Planos</b>
<hr>
      <p><font face="Arial">Podemos cadastrar informa&ccedil;&otilde;es dos Planos 
        de Informa&ccedil;&atilde;o, como Autor, Fonte, Qualidade, Descri&ccedil;&atilde;o, 
        Data, Hora etc. Essas informa&ccedil;&otilde;es adicionais sobre o Plano 
        de Informa&ccedil;&atilde;o s&atilde;o chamadas de metadados. Ao clicar 
        em <b>Propriedades</b> no menu de contexto sobre o nome do Plano, na &Aacute;rvore 
        de Bancos de Dados, &eacute; exibida uma janela contendo as informa&ccedil;&otilde;es 
        sobre o Plano, como mostra a figura abaixo. Os campos em destaque (item 
        1 ao 8) s&atilde;o os metadados.</font></p>
    
      <p align="center"><img src="terraViewBase_arquivos/propriedades_plano.png" width="307" height="457"></p>
      <p><font face="Arial">O usu&aacute;rio pode alterar as informa&ccedil;&otilde;es 
        dos metadados diretamentamente nessa janela ou ent&atilde;o alterar essas 
        informa&ccedil;&otilde;es de uma s&oacute; vez em v&aacute;rios planos, 
        atrav&eacute;s da ferramenta localizada no menu <b>Plano</b> - <b>Atualizar 
        Metadados</b>, exibida na figura abaixo.</font></p>
	  <p align="center"><img src="terraViewBase_arquivos/metadados_multi_planos1.png" width="435" height="475"></p>
      <p><font face="Arial">1. Na lista <b>Planos de entrada</b> selecione os 
        planos para alterar os metadados e clique em <img src="terraViewBase_arquivos/adicionar_planos.png" width="82" height="26"> 
        para adicion&aacute;-los &agrave; lista <b>Planos Selecionados</b>, e 
        p</font><font face="Arial">ara remover um plano selecionado, selecione-o 
        na lista <b>Planos Selecionados</b> e clique em <img src="terraViewBase_arquivos/remover_planos.png" width="80" height="24">.</font></p>
      <p><font face="Arial"> 2. Para adicionar todos os planos &agrave; lista 
        <b>Planos Selecionados</b> clique em <img src="terraViewBase_arquivos/adicionar_todos.png" width="80" height="24"> 
        e para remover todos os planos daquela lista clique em <img src="terraViewBase_arquivos/remover_todos.png" width="80" height="24">.</font></p>
      <p><font face="Arial"> 3. Se desejar, selecione na lista <b>Planos Selecionados</b>, 
        um plano de refer&ecirc;ncia para copiar as suas informa&ccedil;&otilde;es 
        de metadados para os demais planos selecionados, como mostrado na figura 
        anterior (plano AreasVerdes).</font></p>
      <p><font face="Arial">4</font><font face="Arial">. Clique em <b>Pr&oacute;ximo</b>. 
        A janela a seguir ser&aacute; exibida.</font></p>
       <p align="center"><img src="terraViewBase_arquivos/metadados_multi_planos2.png" width="435" height="475"></p>
	  <p><font face="Arial"> 5. Clique em <b>Anterior</b> se desejar alterar a 
        sele&ccedil;&atilde;o dos planos.</font></p>
      <p><font face="Arial">6. Caso um plano tenha sido selecionado como refer&ecirc;ncia 
        no campo <b>Planos Selecionados</b>, os seus metadados ser&atilde;o exibidos 
        nessa janela. Marque a op&ccedil;&atilde;o <b>Todos</b> para atualizar 
        todos os metadados ou marque somente os metadados que deseja atualizar, 
        como mostrado na figura anterior (campos Autor, Fonte, Qualidade). Caso 
        nenhum plano tenha sido selecionado como refer&ecirc;ncia para alterar 
        os metadados, digite as informa&ccedil;&otilde;es diretamente nos campos 
        que deseja atualizar (lembre-se de marcar esses campos para altera&ccedil;&atilde;o).</font></p>
      <p><font face="Arial">7. Clique em <b>Executar</b>.</font></p>
    </td>
      
  </tr>
  
  <tr>
  </tr>
</table>
</font> 
</body>
</html>
