<html>
<head>
<title>Exportação Vetorial</title>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
</head>

<body bgcolor="#FFFFFF" text="#000000">
<font face="Arial, Helvetica, sans-serif" size="4">
<table width="100%">
  <tr>
    <td>&nbsp;</td>
  </tr>
 
    <td><b>Exportação Vetorial M&uacute;ltipla</b><br>
      <hr>
      <p><font face="Arial">O TerraView permite exportar dados vetoriais de v&aacute;rios 
        planos ou temas de uma s&oacute; vez. S&atilde;o exportadas as informa&ccedil;&otilde;es 
        geogr&aacute;ficas em forma de vetores com os atributos associados. Os 
        formatos de exporta&ccedil;&atilde;o dispon&iacute;veis s&atilde;o: SPRING, 
        MID/MIF, Shapefile e TXT. Essa ferramenta pode ser acessada atrav&eacute;s 
        do menu <b>Arquivo</b> - <b>Exporta&ccedil;&atilde;o Vetorial M&uacute;ltipla</b>, 
        que habilita a exporta&ccedil;&atilde;o dos dados dos Planos, ou atrav&eacute;s 
        do menu de contexto sobre o nome da vista, que por sua vez, habilita a 
        exporta&ccedil;&atilde;o dos dados dos Temas selecionados na &Aacute;rvore 
        de Vistas e Temas.</font></p>
    
      <p align="center"><font face="Arial"><img src="terraViewBase_arquivos/exportacao_vetorial_multi.png"></font></p>
      <p><font face="Arial">1. Selecione um <b>Plano</b> ou <b>Tema</b> na lista 
        &agrave; esquerda e clique em <img src="terraViewBase_arquivos/exportacao_vetorial_multi_adicionar.png" width="28" height="25"> 
        para adicion&aacute;-lo &agrave; lista de planos ou temas a serem exportados. 
        Adicione quantos planos ou temas desejar.</font></p>
      <p><font face="Arial"> 2. Selecione um Plano ou Tema na lista &agrave; direita 
        e clique em <img src="terraViewBase_arquivos/exportacao_vetorial_multi_remover.png" width="28" height="25"> 
        para remov&ecirc;-lo da lista de planos ou temas a serem exportados. Remova 
        quantos planos ou temas desejar.</font></p>
      <p  ><font face="Arial"> 3. Escolha o <b>Formato</b> de arquivo a ser gerado. 
        Para o formato TXT ser&atilde;o exportados somente os planos ou temas 
        com representa&ccedil;&atilde;o do tipo ponto.</font></p>
      <p  ><font face="Arial"> 4. Clique em <b>Caminho</b> e defina a pasta de 
        destino dos arquivos a serem gerados. Os nomes dos arquivos ser&atilde;o 
        formados pelo tipo de Fonte (Plano ou Tema) e pelo nome do plano ou tema, 
        por exemplo, PLANO_Colegios.</font></p>
      <p  ><font face="Arial">5. Marque a op&ccedil;&atilde;o <b>Exportar propriedades</b> 
        se desejar exportar as propriedades do Plano, como por exemplo, os par&acirc;metros 
        da proje&ccedil;&atilde;o, ret&acirc;ngulo envolvente etc. Na exporta&ccedil;&atilde;o 
        de Temas essa op&ccedil;&atilde;o &eacute; desabilitada.</font></p>
      <p  ><font face="Arial"> 6. Clique em <b>Executar</b>.</font></p>
    </td>
      
  </tr>
  
  <tr>
  </tr>
</table>
</font> 
</body>
</html>
