<html>
<head>
<title>Sele&ccedil;&atilde;o de Cor</title>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
</head>
<center>
  <H2 align="left"><font face="Arial, Helvetica, sans-serif"><u>Interface de Sele&ccedil;&atilde;o 
    de Cor</u></font></H2>
</center>
<body bgcolor="#FFFFFF">
<p><font face="Arial, Helvetica, sans-serif">A sele&ccedil;&atilde;o de cor &eacute; 
  feita atrav&eacute;s da interface mostrada na Figura 1.</font></p>
<p align="center"><font face="Arial, Helvetica, sans-serif"><img src="selectColor_arquivos/selectColor.png" width="488" height="412"> 
  </font></p>
<p align="center"><font face="Arial, Helvetica, sans-serif">Fig. 1 - Interface 
  de sele&ccedil;&atilde;o de cor.</font></p>
<p align="left"><font face="Arial, Helvetica, sans-serif">A interface, quando 
  &eacute; ativada, mostra no centro inferior a cor corrente do visual que se 
  deseja alterar.</font></p>
<p align="left"><font face="Arial, Helvetica, sans-serif">Essa interface possui 
  48 cores b&aacute;sicas preestabelecidas, e mais16 cores que podem ser customizadas.</font></p>
<p align="left"><font face="Arial, Helvetica, sans-serif">No canto superior direito 
  a interface tem uma barra vertical onde &eacute; ajustada a intensidade ou Val 
  da cor. Logo &agrave; direita dessa barra ela tem um quadro de cores. Esse quadro 
  mostra a varia&ccedil;&atilde;o da matiz ou Hue na horizontal e, a varia&ccedil;&atilde;o 
  da satura&ccedil;&atilde;o ou Sat na vertical. A Figura 2 mostra em detalhe 
  o quadro de cores e a barra de ajuste de intensidade.</font></p>
<p align="center"><font face="Arial, Helvetica, sans-serif"><img src="selectColor_arquivos/colorBars.png" width="239" height="216"></font></p>
<p align="center"><font face="Arial, Helvetica, sans-serif">Fig. 2 - Quadro de 
  cores e a barra de ajuste de intensidade.</font></p>
<p align="left"><font face="Arial, Helvetica, sans-serif">A interface mostra ainda 
  um quadro de valores da cor em termos de componentes Red, Green e Blue que s&atilde;o 
  as cores b&aacute;sicas do espectro vis&iacute;vel e, tamb&eacute;m, sua correspondente 
  em termos de matiz, satura&ccedil;&atilde;o e intensidade. O &quot;Alpha channel&quot;, 
  embora aqui n&atilde;o seja usado, serve para ajustar a transpar&ecirc;ncia 
  ou opacidade da cor. A Figura 3 mostra em detalhe o quadro de valores da cor.</font></p>
<p align="center"><font face="Arial, Helvetica, sans-serif"><img src="selectColor_arquivos/colorSetting.png" width="160" height="115"></font></p>
<p align="center"><font face="Arial, Helvetica, sans-serif">Fig. 3 - Quadro de 
  valores da cor</font></p>
<p align="left"><font face="Arial, Helvetica, sans-serif"> O ajuste de uma cor 
  pode ser feita, pelo teclado, digitando os par&acirc;metros Red, Green e Blue 
  ou Hue, Sat e Val. Pode, tamb&eacute;m, ser feita com o mouse clicando a barra 
  vertical mais o quadro de cores .</font></p>
<p align="left"><font face="Arial, Helvetica, sans-serif">Para customizar uma 
  cor &eacute; preciso selecionar um dos 16 quadrinhos e em seguida com o mouse 
  ou com o teclado escolher uma cor e pressionar o bot&atilde;o &quot;Add to Custom 
  Colors&quot;.</font></p>
<p align="left"><font face="Arial, Helvetica, sans-serif">Normalmente a sele&ccedil;&atilde;o 
  de uma cor &eacute; feita apontado-se para uma das cores b&aacute;sicas, ou 
  apontando-se para uma das cores customizadas. Entretanto, pode-se tamb&eacute;m, 
  apontar diretamente para a barra e o quadro de cores e em seguida pressionar 
  o bot&atilde;o &quot;OK&quot;.</font></p>
<p align="left">&nbsp;</p>
</body>
</html>
