<html>
<head>
<title>TerraView</title>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
</head>

<body bgcolor="#FFFFFF" text="#000000">
<font face="Arial, Helvetica, sans-serif" size="4">
<table width="100%">
  <tr>
 
  </tr>
  <tr> 
    <td><b><font size="4" face="Arial, Helvetica, sans-serif">Visibilidade do 
      Tema</font></b><br>
      <hr>
      <p>Atrav&eacute;s dessa ferramenta pode-se selecionar os tipos de representa&ccedil;&otilde;es, 
        escala de visualiza&ccedil;&atilde;o e outros itens referentes ao tema 
        para visualiza&ccedil;&atilde;o. A defini&ccedil;&atilde;o da escala tem 
        a finalidade de permitir o controle da visualiza&ccedil;&atilde;o dos 
        elementos geom&eacute;tricos associados a um tema, atrav&eacute;s da restri&ccedil;&atilde;o 
        de escala m&iacute;nima e/ou m&aacute;xima. As escalas apropriadas devem 
        ser obtidas atrav&eacute;s da observa&ccedil;&atilde;o do limite m&iacute;nimo 
        e m&aacute;ximo para o tema em quest&atilde;o. O intervalo compreendido 
        entre o limite m&aacute;ximo, por padr&atilde;o, 1/1 e o m&iacute;nimo 
        1/x onde (x &gt; 1), &eacute; denominado intervalo operacional da vista. 
        Na pr&aacute;tica os valores esperados no campo escala m&iacute;nima s&atilde;o 
        n&uacute;meros absolutos maiores do que os esperados no campo escala m&aacute;xima, 
        pois se tratam de denominadores. O intervalo de visibilidade compreende 
        o intervalo de valores de escalas no qual os objetos geogr&aacute;ficos 
        do tema ser&atilde;o exibidos.</p>
      <p> Clique com o bot&atilde;o direito no menu de contexto do tema desejado,
      	ou, se este for também o tema ativo, na &aacute;rea da &Aacute;rea de Visualiza&ccedil;&atilde;o. 
        Um menu de contexto ser&aacute; apresentado, conforme mostra a figura 
        abaixo.</p>
      <p align="center"><img src="terraViewBase_arquivos/visibilidade_representacoes.png" width="220" height="441" border="1"></p>
      <p>Selecione a op&ccedil;&atilde;o <b>Visibilidade das Representa&ccedil;&otilde;es</b>. 
        Uma nova janela ser&aacute; exibida, como vemos na figura a seguir.</p>
      <p align="center"><img src="terraViewBase_arquivos/visibilidade_representacoes1.png" width="305" height="513"></p>
	  <p>1. Marque os tipos de representa&ccedil;&otilde;es que deseja visualizar, 
        por exemplo, pontos e textos. Observe que somente as representa&ccedil;&otilde;es 
        dispon&iacute;veis para o tema s&atilde;o habilitadas.</p>
      <p>2. Marque outros itens para visualiza&ccedil;&atilde;o, como agrupamento 
        e legendas. Observe novamente que somente os itens dispon&iacute;veis 
        para esse tema s&atilde;o habilitados. </p>
      <p>3. Selecione a escala M&iacute;nima e M&aacute;xima para visualiza&ccedil;&atilde;o 
        do tema. Note que o valor da escala m&iacute;nima deve ser maior que o 
        da escala m&aacute;xima, pois a escala m&aacute;xima representa a m&aacute;xima 
        escala de detalhamento para o tema, como explicado anteriormente.</p>
      <p>4. Clique em <b>Executar</b>.</p>
      <p>5. A &Aacute;rea de Visualiza&ccedil;&atilde;o &eacute; atualizada automaticamente 
        de acordo com as op&ccedil;&otilde;es selecionadas.</p>
      <p>&nbsp;</p>
    </td>
  </tr>
  <tr>
  </tr>
</table>
</font> 
</body>
</html>
